# FillGrid Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FillGrid Constructor
FillGrid Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FillGrid()()()() | Creates a simple fill grid. |
| FillGrid(FillGrid) | Constructs a new FillGrid with default settings. |
| FillGrid(Double, Double) | Creates a simple fill grid with given angle and offset. |

# See Also
FillGrid Class
FillGrid Members
Autodesk.Revit.DB Namespace